In [1]:
import pandas as pd

In [2]:
Rent = pd.read_excel('Data/statistic_id275290_monthly-spending-on-food-in-cities-worldwide-2018.xlsx', sheet_name= 1)

In [3]:
Rent

    Unnamed: 0                                         Unnamed: 1  Unnamed: 2
0          NaN                                                NaN         NaN
1          NaN  Monthly spending on food in cities worldwide 2018         NaN
2          NaN  Average monthly spending on food by people in ...         NaN
3          NaN                                                NaN         NaN
4          NaN                                             Geneva      705.77
..         ...                                                ...         ...
76         NaN                                        Mexico City      206.20
77         NaN                                          Bucharest      200.91
78         NaN                                              Cairo      176.68
79         NaN                                              Lagos      156.80
80         NaN                                               Kyiv      155.08

[81 rows x 3 columns]

In [4]:
Rent = Rent.drop(range(4))

In [5]:
Rent = Rent.drop(['Unnamed: 0'], axis =1)

In [6]:
Rent.columns = ['city', 'monthly_food_spend']

In [7]:
Rent

           city  monthly_food_spend
4        Geneva              705.77
5        Zurich              629.32
6         Seoul              592.57
7         Tokyo              529.01
8    Copenhagen              501.30
..          ...                 ...
76  Mexico City              206.20
77    Bucharest              200.91
78        Cairo              176.68
79        Lagos              156.80
80         Kyiv              155.08

[77 rows x 2 columns]

In [8]:
import sqlalchemy

In [9]:
from sqlalchemy import engine

In [10]:
engine  = sqlalchemy.create_engine('postgresql://postgres:B3p1s0k.@localhost:5432/mydb')

In [11]:
Rent.to_sql('city_food', engine, if_exists= 'replace', index = False)

77